---
kind: property
id: P:Autodesk.Revit.DB.ViewSheetSet.Name
source: html/4e00fd0c-78f8-bcd4-2c62-124f79139937.htm
---
# Autodesk.Revit.DB.ViewSheetSet.Name Property

The view sheet set name.

## Syntax (C#)
```csharp
public override string Name { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when trying to set the name. Instead, set the name with the Rename(String) method.